#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьСообщения() Экспорт
	
	IDBot = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	IDGroup = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения
				   |ИЗ
				   |	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту
				   |ГДЕ
				   |	НЕ ВКМ_УведомленияТелеграмБоту.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Сообщения = РезультатЗапроса.Выбрать();
	Пока Сообщения.Следующий() Цикл
		
		Если Не Сообщения.ТекстСообщения = "" Тогда
			Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , Истина);

			Заголовки = Новый Соответствие;
			Заголовки.Вставить("Content-Type", "application/json");

			Запрос = Новый HTTPЗапрос("/bot" + IDBot + "/sendMessage", Заголовки);

			Сообщение = Новый Структура;
			Сообщение.Вставить("chat_id", IDGroup);
			Сообщение.Вставить("text", Сообщения.ТекстСообщения);

			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			ЗаписатьJSON(ЗаписьJSON, Сообщение);
			СообщениеJSON = ЗаписьJSON.Закрыть();

			Запрос.УстановитьТелоИзСтроки(СообщениеJSON);
			Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);

			Если Ответ.КодСостояния = 200 Тогда
				СообщенияОбъект = Сообщения.ПолучитьОбъект();
				СообщенияОбъект.Удалить();
			Иначе
				Сообщить("Хьюстон у нас проблемы");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти