#Область ОбработчикиСобытийЭлементовФорм
Процедура Справочник_ДоговорыКонтрагентов_ВидДоговораПриИзменении(Форма) Экспорт

	Объект = Форма.Объект;

	УстановитьВидимостьЭлементовФормы(Форма.Элементы.ВКМ_ГруппаДополнительныеРеквизитыАбонентскогоОбслуживания,
		Объект.ВидДоговора = ПредопределенноеЗначение(
		"Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание"));
		
КонецПроцедуры

Процедура Документ_РеализацияТоваровУслуг_ДоговорПриИзменении(Форма, ВидДоговора) Экспорт

	УстановитьВидимостьЭлементовФормы(Форма.Элементы.ВКМ_Заполнить,
		ВидДоговора = ПредопределенноеЗначение(
		"Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание"));
		
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура УстановитьВидимостьЭлементовФормы(Элемент, Видимость) Экспорт
	Элемент.Видимость = Видимость;
КонецПроцедуры
#КонецОбласти