#Область ОбработчикиСобытийЭлементовФорм
Процедура Справочник_ДоговорыКонтрагентов_ВидДоговораПриИзменении(Форма) Экспорт
	
	Объект = Форма.Объект;
	
	УстановитьВидимостьЭлементовФормы(Форма.Элементы.ВКМ_ГруппаДополнительныеРеквизитыАбонентскогоОбслуживания, 
										Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание"));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФорм

Процедура Документ_РеализацияТоваровУслуг_ВКМ_КомандаЗаполнить(Форма) Экспорт
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если НЕ ЗначениеЗаполнено(Объект.Договор) Тогда
		Возврат
	КонецЕсли;

	Если ВКМ_ФормыСлужебный.АбонентскоеОбслуживание(Объект.Договор) Тогда
		Элементы.ВКМ_Заполнить.Видимость = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Абонентское обслуживание");
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередАвтозаполнениемЗавершение", ЭтотОбъект),
						"Перед заполнением табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьВидимостьЭлементовФормы(Элемент, Видимость) Экспорт
	Элемент.Видимость = Видимость;
КонецПроцедуры

Процедура ПередАвтозаполнениемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		//ВыполнитьАвтозаполнение();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти