#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПериодРегистрации = НачалоМесяца(Дата);
	
	// регистр ВКМ_ДополнительныеНачисления
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	
	Для Каждого Строка из СписокСотрудников Цикл
		
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
		Движение.Результат = Движение.Сумма;

	КонецЦикла;
	
	ПараметрыДвижений = Новый Структура;
	ПараметрыДвижений.Вставить("Ссылка", Ссылка);
	ПараметрыДвижений.Вставить("Дата", Дата);
	ПараметрыДвижений.Вставить("Движения", Движения);
	ПараметрыДвижений.Вставить("ДвиженияНачислений", Движения.ВКМ_ДополнительныеНачисления);
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	
	ВКМ_Служебный.ЗаполнитьУдержанияНДФЛ(ПараметрыДвижений);
	
	ВКМ_Служебный.ЗаполнитьВзаиморасчетыССотрудниками(Дата, Ссылка, Движения);
	
КонецПроцедуры

#КонецОбласти