#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПериодРегистрации = НачалоМесяца(Дата);
	
	// регистр ВКМ_ДополнительныеНачисления
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	
	Для Каждого Строка из СписокСотрудников Цикл
		
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
		Движение.Результат = Движение.Сумма;

		ВКМ_Служебный.ЗаполнитьУдержанияНДФЛ(Движения, Движение);
		
	КонецЦикла;
	
	ВКМ_Служебный.ЗаполнитьВзаиморасчетыССотрудниками(Дата, Ссылка, Движения);
	
КонецПроцедуры

#КонецОбласти