#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Получаем условия оплаты сотруднику за работу
	УсловияОплатыСотрудника = ВКМ_Служебный.ПолучитьУсловияОплаты(Дата, Сотрудник);
	
	//Проверка установленных условий оплаты для сотрудника
	Если НЕ УсловияОплатыСотрудника.Пустой() Тогда
		
		//Получаем процент оплаты сотрудника за работу
		Выборка = УсловияОплатыСотрудника.Выбрать();
		Выборка.Следующий();
		ОплачиваемыйПроцент = Выборка.ПроцентОтРабот;
		
		//Проверка корректности даты проведения работ и срока договора
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВидДоговора")
			= Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда

			ДатаДействияДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор,
				"ВКМ_НачалоДействияДоговора, ВКМ_ОкончаниеДействияДоговора");

			Если ДатаДействияДоговора.ВКМ_НачалоДействияДоговора > ДатаПроведенияРабот Тогда
				Отказ = Истина;
				ОбщегоНазначения.СообщитьПользователю(
				"Дата проведения работ не может быть меньше даты начала действия договора");
			КонецЕсли;

			Если ДатаДействияДоговора.ВКМ_ОкончаниеДействияДоговора < ДатаПроведенияРабот Тогда
				Отказ = Истина;
				ОбщегоНазначения.СообщитьПользователю(
				"Дата проведения работ не может быть больше даты окончания действия договора");
			КонецЕсли;

			//Получаем стоимость часа работы по договору
			СтоимостьЧасаРаботы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВКМ_СтоимостьЧасаРаботы");
	
			// регистр ВКМ_ВыполненныеКлиентуРаботы
			Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
			
			// регистр ВКМ_ВыполненныеСотрудникомРаботы
			Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;

			Для Каждого Строка Из ВыполненныеРаботы Цикл

				Движение1 = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
				Движение1.Период = Дата;
				Движение1.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение1.Клиент = Клиент;
				Движение1.Договор = Договор;
				Движение1.Сотрудник = Сотрудник;
				Движение1.ОписаниеРабот = Строка.ОписаниеРабот;
				Движение1.КоличествоЧасов = Строка.ЧасыКОплатеКлиенту;
				
				СуммаКОплате = Движение1.КоличествоЧасов * СтоимостьЧасаРаботы;
				
				Движение1.СуммаКОплате = СуммаКОплате;
				
				Движение2 = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
				Движение2.Период = Дата;
				Движение2.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение2.Сотрудник = Сотрудник;
				Движение2.ЧасовКОплате = Строка.ЧасыКОплатеКлиенту;
				Движение2.СуммаКОплате = СуммаКОплате * ОплачиваемыйПроцент / 100;
				Движение2.ОписаниеРабот = Строка.ОписаниеРабот;
				
			КонецЦикла;
			
		Иначе
			
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Необходимо выбрать договор с видом ""Абонентское обслуживание""");
		
		КонецЕсли;
		
	Иначе
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
			"Сотруднику %1 на дату документа не установлены условия оплаты", Сотрудник));
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	СообщениеДокумента = Справочники.ВКМ_УведомленияТелеграмБоту.НайтиПоРеквизиту("ДокументИсточник", Ссылка);
	Если ЗначениеЗаполнено(СообщениеДокумента) Тогда
		СообщениеДокументаОбъект = СообщениеДокумента.ПолучитьОбъект();
		СообщениеДокументаОбъект.Удалить();
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда

		ТекстСообщения = СтрШаблон("Заказ №%1 от %2
									|Клиент: %3
									|Дата: %4
									|Время начала: %5
									|Время окончания: %6
									|Специалист: %7
									|Описание: %8", 
									Номер, 
									Формат(Дата, "ДФ=dd.MM.yyyy;"), 
									Клиент,
									Формат(ДатаПроведенияРабот, "ДЛФ=DD;"), 
									Формат(ВремяНачалаРабот, "ДФ=HH:mm;"), 
									Формат(ВремяОкончанияРабот, "ДФ=HH:mm;"), 
									Сотрудник, 
									ОписаниеПроблемы);
		
		ЕстьИзменения = Ложь;
		
		Если ЭтоНовый() Тогда

			ТекстСообщения = СтрЗаменить(ТекстСообщения, "Заказ №", "Новый заказ №");
			СохрСотрудник = Сотрудник;
			СохрДатаПроведенияРабот = ДатаПроведенияРабот;
			СохрВремяНачалаРабот = ВремяНачалаРабот;
			СохрВремяОкончанияРабот = ВремяОкончанияРабот;
			
		Иначе
			
			Если ЗначениеЗаполнено(СохрСотрудник) 
					И СохрСотрудник <> Сотрудник Тогда
						
				ЕстьИзменения = Истина;
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "Заказ №", "ИЗМЕНЕН заказ №");
				ТекстСообщения = ТекстСообщения + Символы.ПС 
								+ "------------------" + Символы.ПС 
								+ СтрШаблон("Специалист изменен с %1 на %2", 
											СохрСотрудник,
											Сотрудник);
				СохрСотрудник = Сотрудник;
					
			КонецЕсли;

			Если ЗначениеЗаполнено(СохрДатаПроведенияРабот) 
					И СохрДатаПроведенияРабот <> ДатаПроведенияРабот Тогда
						
				ЕстьИзменения = Истина;
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "Заказ №", "ИЗМЕНЕН заказ №");
				ТекстСообщения = ТекстСообщения + Символы.ПС 
								+ "------------------" + Символы.ПС
								+ СтрШаблон("Дата изменена с %1 на %2", 
											Формат(СохрДатаПроведенияРабот, "ДЛФ=DD;"), 
											Формат(ДатаПроведенияРабот, "ДЛФ=DD;"));
				СохрДатаПроведенияРабот = ДатаПроведенияРабот;
				
			КонецЕсли;

			Если ЗначениеЗаполнено(СохрВремяНачалаРабот) 
					И ЗначениеЗаполнено(СохрВремяОкончанияРабот)
					И (СохрВремяНачалаРабот <> ВремяНачалаРабот 
					ИЛИ СохрВремяОкончанияРабот <> ВремяОкончанияРабот) Тогда
						
				ЕстьИзменения = Истина;
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "Заказ №", "ИЗМЕНЕН заказ №");
				ТекстСообщения = ТекстСообщения + Символы.ПС 
								+ "------------------" + Символы.ПС
								+ СтрШаблон("Время проведения работ изменено с %1 - %2 на %3 - %4", 
											Формат(СохрВремяНачалаРабот, "ДФ=HH:mm;"),
											Формат(СохрВремяОкончанияРабот, "ДФ=HH:mm;"), 
											Формат(ВремяНачалаРабот, "ДФ=HH:mm;"), 
											Формат(ВремяОкончанияРабот, "ДФ=HH:mm;"));
				СохрВремяНачалаРабот = ВремяНачалаРабот;
				СохрВремяОкончанияРабот = ВремяОкончанияРабот;							
			КонецЕсли;

		КонецЕсли;

		НикСотрудника = ВКМ_Служебный.ПолучитьНикСотрудника(Сотрудник);
		Если НЕ ПустаяСтрока(НикСотрудника) Тогда

			ТекстСообщения = ТекстСообщения + Символы.ПС + "@" + НикСотрудника;

		КонецЕсли;

		Если ЭтоНовый() ИЛИ ЕстьИзменения Тогда
			ВКМ_Служебный.СоздатьСообщениеДляОтправки(ТекстСообщения, Ссылка);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
#КонецОбласти

