#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Получаем условия оплаты сотруднику за работу
	УсловияОплатыСотрудника = ВКМ_Служебный.ПолучитьУсловияОплаты(Дата, Сотрудник);
	
	//Проверка установленных условий оплаты для сотрудника
	Если НЕ УсловияОплатыСотрудника.Пустой() Тогда
		
		//Получаем процент оплаты сотрудника за работу
		Выборка = УсловияОплатыСотрудника.Выбрать();
		Выборка.Следующий();
		ОплачиваемыйПроцент = Выборка.ПроцентОтРабот;
		
		//Проверка корректности даты проведения работ и срока договора
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВидДоговора")
			= Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда

			ДатаДействияДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор,
				"ВКМ_НачалоДействияДоговора, ВКМ_ОкончаниеДействияДоговора");

			Если ДатаДействияДоговора.ВКМ_НачалоДействияДоговора > ДатаПроведенияРабот Тогда
				Отказ = Истина;
				ОбщегоНазначения.СообщитьПользователю(
				"Дата проведения работ не может быть меньше даты начала действия договора");
			КонецЕсли;

			Если ДатаДействияДоговора.ВКМ_ОкончаниеДействияДоговора < ДатаПроведенияРабот Тогда
				Отказ = Истина;
				ОбщегоНазначения.СообщитьПользователю(
				"Дата проведения работ не может быть больше даты окончания действия договора");
			КонецЕсли;

			//Получаем стоимость часа работы по договору
			СтоимостьЧасаРаботы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВКМ_СтоимостьЧасаРаботы");
	
			// регистр ВКМ_ВыполненныеКлиентуРаботы
			Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
			
			// регистр ВКМ_ВыполненныеСотрудникомРаботы
			Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;

			Для Каждого Строка Из ВыполненныеРаботы Цикл

				Движение1 = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
				Движение1.Период = Дата;
				Движение1.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение1.Клиент = Клиент;
				Движение1.Договор = Договор;
				Движение1.Сотрудник = Сотрудник;
				Движение1.ОписаниеРабот = Строка.ОписаниеРабот;
				Движение1.КоличествоЧасов = Строка.ЧасыКОплатеКлиенту;
				
				СуммаКОплате = Движение1.КоличествоЧасов * СтоимостьЧасаРаботы;
				
				Движение1.СуммаКОплате = СуммаКОплате;
				
				Движение2 = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
				Движение2.Период = Дата;
				Движение2.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение2.Сотрудник = Сотрудник;
				Движение2.ЧасовКОплате = Строка.ЧасыКОплатеКлиенту;
				
				
				
				Движение2.СуммаКОплате = СуммаКОплате * ОплачиваемыйПроцент / 100;
				Движение2.ОписаниеРабот = Строка.ОписаниеРабот;
				
			КонецЦикла;

		Иначе
			
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Необходимо выбрать договор с видом ""Абонентское обслуживание""");
		
		КонецЕсли;
		
	Иначе
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
			"Сотруднику %1 на дату документа не установлены условия оплаты", Сотрудник));
			
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	СообщениеДокумента = Справочники.ВКМ_УведомленияТелеграмБоту.НайтиПоРеквизиту("ДокументИсточник", Ссылка);
	Если ЗначениеЗаполнено(СообщениеДокумента) Тогда
		СообщениеДокументаОбъект = СообщениеДокумента.ПолучитьОбъект();
		СообщениеДокументаОбъект.Удалить();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти