
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
		
        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
        КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт 
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Акт";
	КомандаПечати.Представление = "Акт об оказанных услугах";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";

КонецПроцедуры 

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт 	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Акт") Тогда
 		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Акт", "Акт об оказанных услугах", 
			ПечатьДокумента(МассивОбъектов),"Документ.Приказ.Акт", "Документ.РеализацияТоваровУслуг.ПФ_MXL_АктОбОказанныхУслугах");
	КонецЕсли;
	
КонецПроцедуры 

Функция ПечатьДокумента(МассивОбъектов)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_Акт";
	
	Для каждого Ссылка из МассивОбъектов Цикл
		ТабДокументОбъекта = СформироватьАкт(Ссылка); 
		Если ТабДокумент.ВысотаТаблицы > 0 И ТабДокументОбъекта.ВысотаТаблицы > 0 Тогда 
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц()
		КонецЕсли;
		ТабДокумент.Вывести(ТабДокументОбъекта)
	КонецЦикла;
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокументОбъекта, Ссылка, ТабДокумент, МассивОбъектов);
	Возврат ТабДокумент

КонецФункции 

Функция  СформироватьАкт(Ссылка)

	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ПФ_MXL_АктОбОказанныхУслугах");
	
	//Шапка
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Исполнитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка.Организация, "НаименованиеПолное");
	ОбластьШапка.ДатаДокумента = Ссылка.Дата;
	ОбластьШапка.НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Ссылка.Номер);
	ОбластьШапка.Заказчик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка.Контрагент, "НаименованиеПолное");
	ТабДокумент.Вывести(ОбластьШапка); 
	// подготовка ТабДокумента
	Возврат ТабДокумент 

КонецФункции 

Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт	
	НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
КонецПроцедуры