
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
		
        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
        КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт 
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПечатьАкт";
	КомандаПечати.Представление = "Акт об оказанных услугах";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";

КонецПроцедуры 

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт 
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьАкт") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПечатьАкт", "Акт об оказанных услугах", 
			ПечатьДокумента(МассивОбъектов), "Документ.РеализацияТоваровУслуг.ПФ_MXL_АктОбОказанныхУслугах", "ПФ_MXL_АктОбОказанныхУслугах");
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьДокумента(МассивОбъектов)
	
	Если НЕ ТипЗнч(МассивОбъектов) = Тип("Массив") ИЛИ МассивОбъектов.Количество() = 0 Тогда
		Возврат Новый ТабличныйДокумент;
	КонецЕсли;
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_Акт";
	
	ПервыйДокумент = Истина;
	
	Для каждого Ссылка Из МассивОбъектов Цикл
		ТабДокументОбъекта = СформироватьАкт(Ссылка);
		
		Если НЕ ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(ТабДокументОбъекта);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокументОбъекта, Ссылка, ТабДокумент);
		
		ПервыйДокумент = Ложь;
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

 

Функция СформироватьАкт(Ссылка) Экспорт
	
	Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
		Возврат Новый ТабличныйДокумент;
	КонецЕсли;
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ПФ_MXL_АктОбОказанныхУслугах");
	
	//Шапка
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Исполнитель = Ссылка.Организация.НаименованиеПолное;
	ОбластьШапка.Параметры.ДатаОт = Ссылка.Дата;
	ОбластьШапка.Параметры.Номер = Ссылка.Номер;
	ОбластьШапка.Параметры.Заказчик = Ссылка.Контрагент.НаименованиеПолное;
	ТабДокумент.Вывести(ОбластьШапка); 
	
	Возврат ТабДокумент;
	
КонецФункции
 

Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт	
	НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
КонецПроцедуры