#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВКМ_ФормыСлужебныйКлиент.УстановитьВидимостьЭлементовФормы(Элементы.ПроцентОтРабот, 
																Объект.Категория = ПредопределенноеЗначение("Перечисление.ВКМ_КатегорияСотрудника.Специалист"));	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	
	ВКМ_ФормыСлужебныйКлиент.УстановитьВидимостьЭлементовФормы(Элементы.ПроцентОтРабот, 
																Объект.Категория = ПредопределенноеЗначение("Перечисление.ВКМ_КатегорияСотрудника.Специалист"));	
	
	Если Объект.Категория = ПредопределенноеЗначение("Перечисление.ВКМ_КатегорияСотрудника.АдминистративныйПесонал") Тогда
		Объект.ПроцентОтРабот = 0;
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти