#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВКМ_ФормыСлужебныйКлиент.УстановитьВидимостьЭлементовФормы(Элементы.ПроцентОтРабот, 
																Объект.Категория = ПредопределенноеЗначение("Перечисление.ВКМ_КатегорияСотрудника.Специалист"));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ УправлениеДоступом.ЕстьРоль("ВКМ_ДобавлениеИзменениеДокументовОплатыТруда")
		 	ИЛИ НЕ УправлениеДоступом.ЕстьРоль("ПолныеПрава") Тогда
		Элементы.УсловияОплаты.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	
	ВКМ_ФормыСлужебныйКлиент.УстановитьВидимостьЭлементовФормы(Элементы.ПроцентОтРабот, 
																Объект.Категория = ПредопределенноеЗначение("Перечисление.ВКМ_КатегорияСотрудника.Специалист"));	
	
	Если Объект.Категория = ПредопределенноеЗначение("Перечисление.ВКМ_КатегорияСотрудника.АдминистративныйПесонал") Тогда
		Объект.ПроцентОтРабот = 0;
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти