
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЕстьПравоНаОтправкуСообщений = ПравоДоступа("Изменение", Метаданные.Документы.ВКМ_ОбслуживаниеКлиента);
	Элементы.ВКМ_ОтправитьСообщения.Видимость = ЕстьПравоНаОтправкуСообщений;
КонецПроцедуры

&НаСервере
Процедура ВКМ_ОтправитьСообщенияНаСервере()
	ВКМ_Телеграм.ОтправитьСообщения();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ОтправитьСообщения(Команда)
	ВКМ_ОтправитьСообщенияНаСервере();
КонецПроцедуры
