#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	АдресВоВременномХранилище = ВыгрузитьТаблицуВоВременноеХранилище();
	
	ПараметрыФормы = Новый Структура("Ссылка", Объект.Ссылка);
	ПараметрыФормы.Вставить("Год", НачалоГода(Объект.Год));
	ПараметрыФормы.Вставить("АдресВоВременномХранилище", АдресВоВременномХранилище);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыгрузитьТаблицуВоВременноеХранилище()
	
	ТЗ = Объект.ОтпускаСотрудников.Выгрузить();
	
	Возврат ПоместитьВоВременноеХранилище(ТЗ, УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти