#Область СлужебныеПроцедурыИФункции
Функция ПолучитьУсловияОплаты(Дата, Сотрудники) Экспорт
	
	Если НЕ ТипЗнч(Сотрудники) = Тип("Массив") И ТипЗНЧ(Сотрудники) = Тип("СправочникСсылка.ВКМ_Сотрудники") Тогда
		МассивСотрудников = Новый Массив;
		МассивСотрудников.Добавить(Сотрудники);
	Иначе
		МассивСотрудников = Сотрудники;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.КатегорияСотрудника КАК КатегорияСотрудника,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 0) КАК Оклад,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник В (&Сотрудники)) КАК
	|		ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Сотрудники", МассивСотрудников);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции
#КонецОбласти