#Область СлужебныеПроцедурыИФункции

Функция ПолучитьУсловияОплаты(Дата, Сотрудники) Экспорт
	
	Если НЕ ТипЗнч(Сотрудники) = Тип("Массив") И ТипЗНЧ(Сотрудники) = Тип("СправочникСсылка.ВКМ_Сотрудники") Тогда
		МассивСотрудников = Новый Массив;
		МассивСотрудников.Добавить(Сотрудники);
	Иначе
		МассивСотрудников = Сотрудники;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.КатегорияСотрудника КАК КатегорияСотрудника,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 0) КАК Оклад,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник В (&Сотрудники)) КАК
	|		ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Сотрудники", МассивСотрудников);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьУдержанияНДФЛ(Движения, Движение) Экспорт
	
	Движения.ВКМ_Удержания.Записывать = Истина;

	ДвижениеУдерж = Движения.ВКМ_Удержания.Добавить();
	ЗаполнитьЗначенияСвойств(ДвижениеУдерж, Движение);
	ДвижениеУдерж.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.УдержаниеНДФЛ;
	ДвижениеУдерж.ВидНачисления = Движение.ВидРасчета;
	ДвижениеУдерж.Сумма = Движение.Результат;
	ДвижениеУдерж.Результат = Движение.Результат * 0.13;
	
КонецПроцедуры

Процедура ЗаполнитьВзаиморасчетыССотрудниками(Дата, Ссылка, Движения) Экспорт
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|	СУММА(ВКМ_ОсновныеНачисления.Результат) КАК Сумма
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Регистратор
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОсновныеНачисления.ВидРасчета,
		|	ВКМ_ОсновныеНачисления.Сотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВКМ_Удержания.Сотрудник КАК Сотрудник,
		|	ВКМ_Удержания.ВидРасчета КАК ВидРасчета,
		|	СУММА(ВКМ_Удержания.Результат) КАК Сумма
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|ГДЕ
		|	ВКМ_Удержания.Регистратор = &Регистратор
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_Удержания.ВидРасчета,
		|	ВКМ_Удержания.Сотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
		|	СУММА(ВКМ_ДополнительныеНачисления.Результат) КАК Сумма
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор = &Регистратор
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ДополнительныеНачисления.ВидРасчета,
		|	ВКМ_ДополнительныеНачисления.Сотрудник";
		
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ТипЗнч(Выборка.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ОсновныеНачисления")
			ИЛИ ТипЗнч(Выборка.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления") Тогда
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
		ИначеЕсли ТипЗнч(Выборка.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_Удержания") Тогда
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьРасход();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		Движение.Период = Дата;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПроцентОтПроведенныхРабот(Дата, МассивСотрудников) Экспорт

	НачалоПериода = НачалоМесяца(Дата);
	КонецПериода = КонецМесяца(Дата);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник КАК Сотрудник,
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.ЧасовКОплатеПриход КАК ЧасовКОплате,
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеПриход КАК СуммаКОплате
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода,, Сотрудник В
		|	(&Сотрудники)) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты";
	
	Запрос.УстановитьПараметр("Сотрудники", МассивСотрудников);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ПолучитьИнформациюОДоговоре(Договор) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Представление КАК Представление,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора КАК ВКМ_НачалоДействияДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора КАК ВКМ_ОкончаниеДействияДоговора,
	|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК ВКМ_СуммаАбонентскойПлаты,
	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК ВКМ_СтоимостьЧасаРаботы,
	|	ДоговорыКонтрагентов.Организация КАК Организация,
	|	ДоговорыКонтрагентов.Владелец КАК Владелец
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Ссылка");
							
	Запрос.УстановитьПараметр("Ссылка", Договор);						
	Выборка = Запрос.Выполнить().Выбрать();
	
	Массив = Новый Массив();
	Выборка.Следующий();
		
		СтруктураДоговора = Новый Структура;
		СтруктураДоговора.Вставить("Ссылка", Выборка.Ссылка);
		СтруктураДоговора.Вставить("Представление", Выборка.Представление);
		СтруктураДоговора.Вставить("ВидДоговора", Выборка.ВидДоговора);
		СтруктураДоговора.Вставить("НачалоДействияДоговора", Выборка.ВКМ_НачалоДействияДоговора);
		СтруктураДоговора.Вставить("ОкончаниеДействияДоговора", Выборка.ВКМ_ОкончаниеДействияДоговора);
		СтруктураДоговора.Вставить("СуммаАбонентскойПлаты", Выборка.ВКМ_СуммаАбонентскойПлаты);
		СтруктураДоговора.Вставить("СтоимостьЧасаРаботы", Выборка.ВКМ_СтоимостьЧасаРаботы);
		СтруктураДоговора.Вставить("Организация", Выборка.Организация);
		СтруктураДоговора.Вставить("Владелец", Выборка.Владелец);
		
		Массив.Добавить(СтруктураДоговора);
	
	Возврат СтруктураДоговора;

КонецФункции
#КонецОбласти