#Область СлужебныеПроцедурыИФункции

Функция ПолучитьУсловияОплаты(Дата, Сотрудники) Экспорт
	
	Если НЕ ТипЗнч(Сотрудники) = Тип("Массив") И ТипЗнч(Сотрудники) = Тип("СправочникСсылка.ВКМ_Сотрудники") Тогда
		МассивСотрудников = Новый Массив;
		МассивСотрудников.Добавить(Сотрудники);
	Иначе
		МассивСотрудников = Сотрудники;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.КатегорияСотрудника КАК КатегорияСотрудника,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 0) КАК Оклад,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник В (&Сотрудники)) КАК
	|		ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Сотрудники", МассивСотрудников);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьУдержанияНДФЛ(ПараметрыДвижений) Экспорт
	
	Движения = ПараметрыДвижений.Движения;
	ДвиженияНачислений = ПараметрыДвижений.ДвиженияНачислений;
	Ссылка = ПараметрыДвижений.Ссылка;
	Дата = ПараметрыДвижений.Дата;
	
	ПериодРегистрации = НачалоМесяца(Дата);
	
	Движения.ВКМ_Удержания.Записывать = Истина;

	Если ДвиженияНачислений.Количество() Тогда
		
		Для Каждого Движение Из ДвиженияНачислений Цикл

			ДвижениеУдерж = Движения.ВКМ_Удержания.Добавить();
			ДвижениеУдерж.Регистратор = Движение.Регистратор;
			ДвижениеУдерж.ПериодРегистрации = ПериодРегистрации;
			ДвижениеУдерж.Сотрудник = Движение.Сотрудник;
			ДвижениеУдерж.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.УдержаниеНДФЛ;
			ДвижениеУдерж.ВидНачисления = Движение.ВидРасчета;
			
			Если Движение.Сторно Тогда
				ДвижениеУдерж.Сторно = Движение.Сторно;
				ДвижениеУдерж.СуммаБаза = -Движение.Результат;
			КонецЕсли;
				
			
			Если ТипЗнч(Движение) = ТИП("РегистрРасчетаЗапись.ВКМ_ОсновныеНачисления") Тогда	
				ДвижениеУдерж.БазовыйПериодНачало = Движение.ПериодДействияНачало;
				ДвижениеУдерж.БазовыйПериодКонец = Движение.ПериодДействияКонец;
			ИначеЕсли ТипЗнч(Движение) = ТИП("РегистрРасчетаЗапись.ВКМ_ДополнительныеНачисления") Тогда
				ДвижениеУдерж.БазовыйПериодНачало = Движение.ПериодРегистрации;
				ДвижениеУдерж.БазовыйПериодКонец = Движение.ПериодРегистрации;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Движения.ВКМ_Удержания.Записать();
	Движения.ВКМ_Удержания.Записывать = Истина;
	
	//Расчет результата удержаний
	Запрос = Новый Запрос;
	Если ТипЗнч(ДвиженияНачислений) = ТИП("РегистрРасчетаНаборЗаписей.ВКМ_ОсновныеНачисления") Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
					   |	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
					   |	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Регистратор КАК Регистратор,
					   |	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Активность КАК Активность,
					   |	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Сторно КАК Сторно,
					   |	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.ВидНачисления КАК ВидНачисления,
					   |	ВЫБОР
					   |		КОГДА ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Сторно
					   |			ТОГДА ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Результат
					   |		ИНАЧЕ ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РезультатБаза
					   |	КОНЕЦ КАК СуммаБаза
					   |ИЗ
					   |	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения, &Разрез,
					   |		Регистратор = &Регистратор) КАК ВКМ_УдержанияБазаВКМ_ОсновныеНачисления";

	ИначеЕсли ТипЗнч(ДвиженияНачислений) = ТИП("РегистрРасчетаНаборЗаписей.ВКМ_ДополнительныеНачисления") Тогда

		Запрос.Текст = "ВЫБРАТЬ
					   |	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
					   |	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.Регистратор КАК Регистратор,
					   |	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.Активность КАК Активность,
					   |	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.ВидНачисления КАК ВидНачисления,
					   |	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РезультатБаза КАК СуммаБаза
					   |ИЗ
					   |	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(&Измерения, &Измерения,,
					   |		Регистратор = &Регистратор) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления";
		
	КонецЕсли;
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);

	Разрез = Новый Массив;
	Разрез.Добавить("Регистратор");
	Запрос.УстановитьПараметр("Разрез", Разрез);

	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Для Каждого Движение Из Движения.ВКМ_Удержания Цикл
		
		Выборка.Сбросить();
		
		СтруктураПоиска = Новый Структура("НомерСтроки, ВидНачисления");
		СтруктураПоиска.НомерСтроки = Движение.НомерСтроки;
		СтруктураПоиска.ВидНачисления = Движение.ВидНачисления;
		
		Выборка.НайтиСледующий(СтруктураПоиска);
		
		Если Выборка.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ Движение.Сторно Тогда
			Движение.СуммаБаза = Выборка.СуммаБаза;
			Движение.Результат = Выборка.СуммаБаза * 0.13;	
		Иначе
			Движение.Результат = -Движение.СуммаБаза * 0.13;
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать(, Истина);
		
КонецПроцедуры

Процедура ЗаполнитьВзаиморасчетыССотрудниками(Дата, Ссылка, Движения) Экспорт
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|	СУММА(ВКМ_ОсновныеНачисления.Результат) КАК Сумма
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Регистратор
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОсновныеНачисления.ВидРасчета,
		|	ВКМ_ОсновныеНачисления.Сотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВКМ_Удержания.Сотрудник КАК Сотрудник,
		|	ВКМ_Удержания.ВидРасчета КАК ВидРасчета,
		|	СУММА(ВКМ_Удержания.Результат) КАК Сумма
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|ГДЕ
		|	ВКМ_Удержания.Регистратор = &Регистратор
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_Удержания.ВидРасчета,
		|	ВКМ_Удержания.Сотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
		|	СУММА(ВКМ_ДополнительныеНачисления.Результат) КАК Сумма
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор = &Регистратор
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ДополнительныеНачисления.ВидРасчета,
		|	ВКМ_ДополнительныеНачисления.Сотрудник";
		
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ТипЗнч(Выборка.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ОсновныеНачисления")
			ИЛИ ТипЗнч(Выборка.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления") Тогда
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
		ИначеЕсли ТипЗнч(Выборка.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_Удержания") Тогда
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьРасход();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		Движение.Период = Дата;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПроцентОтПроведенныхРабот(Дата, МассивСотрудников) Экспорт

	НачалоПериода = НачалоМесяца(Дата);
	КонецПериода = КонецМесяца(Дата);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник КАК Сотрудник,
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.ЧасовКОплатеПриход КАК ЧасовКОплате,
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеПриход КАК СуммаКОплате
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода,, Сотрудник В
		|	(&Сотрудники)) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты";
	
	Запрос.УстановитьПараметр("Сотрудники", МассивСотрудников);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ПолучитьИнформациюОДоговоре(Договор) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Представление КАК Представление,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора КАК ВКМ_НачалоДействияДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора КАК ВКМ_ОкончаниеДействияДоговора,
	|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК ВКМ_СуммаАбонентскойПлаты,
	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК ВКМ_СтоимостьЧасаРаботы,
	|	ДоговорыКонтрагентов.Организация КАК Организация,
	|	ДоговорыКонтрагентов.Владелец КАК Владелец
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Ссылка");
							
	Запрос.УстановитьПараметр("Ссылка", Договор);						
	Выборка = Запрос.Выполнить().Выбрать();
	
	Массив = Новый Массив();
	Выборка.Следующий();
		
		СтруктураДоговора = Новый Структура;
		СтруктураДоговора.Вставить("Ссылка", Выборка.Ссылка);
		СтруктураДоговора.Вставить("Представление", Выборка.Представление);
		СтруктураДоговора.Вставить("ВидДоговора", Выборка.ВидДоговора);
		СтруктураДоговора.Вставить("НачалоДействияДоговора", Выборка.ВКМ_НачалоДействияДоговора);
		СтруктураДоговора.Вставить("ОкончаниеДействияДоговора", Выборка.ВКМ_ОкончаниеДействияДоговора);
		СтруктураДоговора.Вставить("СуммаАбонентскойПлаты", Выборка.ВКМ_СуммаАбонентскойПлаты);
		СтруктураДоговора.Вставить("СтоимостьЧасаРаботы", Выборка.ВКМ_СтоимостьЧасаРаботы);
		СтруктураДоговора.Вставить("Организация", Выборка.Организация);
		СтруктураДоговора.Вставить("Владелец", Выборка.Владелец);
		
		Массив.Добавить(СтруктураДоговора);
	
	Возврат СтруктураДоговора;

КонецФункции

Функция ПолучитьНикСотрудника(Сотрудник) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_Сотрудники.НикВТелеграмм КАК НикВТелеграмм
		|ИЗ
		|	Справочник.ВКМ_Сотрудники КАК ВКМ_Сотрудники
		|ГДЕ
		|	ВКМ_Сотрудники.Ссылка = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.НикВТелеграмм;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции

Процедура СоздатьСообщениеДляОтправки(ТекстСообщения, Источник) Экспорт
	СообщениеБота = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	СообщениеБота.ТекстСообщения = ТекстСообщения;
	СообщениеБота.ДокументИсточник = Источник;
	СообщениеБота.Записать();
КонецПроцедуры

Процедура МассовоеСозданиеАктов_СоздатьДокументыРеализации(СписокДоговоров, Период) Экспорт
	
	Для Каждого Строка Из СписокДоговоров Цикл
		
		Если ЗначениеЗаполнено(Строка.ДокументРеализацииУслуг) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		ДокументОбъект.Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Договор, "Организация");
		ДокументОбъект.Дата = КонецМесяца(Период.ДатаОкончания);
		ДокументОбъект.Договор = Строка.Договор;
		ДокументОбъект.Контрагент = Строка.Контрагент;
		ДокументОбъект.ВКМ_ВыполнитьАвтозаполнение();
		ДокументОбъект.СуммаДокумента = ДокументОбъект.Товары.Итог("Сумма") + ДокументОбъект.Услуги.Итог("Сумма");
		
		Если ДокументОбъект.СуммаДокумента = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не удалось создать документ по договору %1 - нет услуг для реализации.",
													Строка.Договор));
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект.Основание = Строка.Договор;
		ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
		ДокументОбъект.Комментарий = "Создан автоматически обработкой ""МассовоеСозданиеАктов""";
		ДокументОбъект.ПроверитьЗаполнение();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти