
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ УправлениеДоступом.ЕстьРоль("ВКМ_ДобавлениеИзменениеДокументовОплатыТруда")
		ИЛИ НЕ УправлениеДоступом.ЕстьРоль("ПолныеПрава") Тогда
		 			
		Элементы.Оклад.Видимость = Ложь;
		Элементы.ПроцентОтРабот.Видимость = Ложь;
		 	
	КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
