#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ВКМ_изменено
	//++ Бормотов.А.Ю.
	ВКМ_ФормыСлужебный.Справочник_ДоговорыКонтрагентов_ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	//+-- Бормотов.А.Ю.
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//ВКМ_изменено
	//++ Бормотов.А.Ю.
	Если НЕ ТекущийОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		ТекущийОбъект.ВКМ_НачалоДействияДоговора = Дата(1,1,1);
		ТекущийОбъект.ВКМ_ОкончаниеДействияДоговора = Дата(1,1,1);
		ТекущийОбъект.ВКМ_СуммаАбонентскойПлаты = 0;
		ТекущийОбъект.ВКМ_СтоимостьЧасаРаботы = 0;
	КонецЕсли;
	//-- Бормотов.А.Ю.
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	//ВКМ_изменено
	//++ Бормотов.А.Ю.
	ВКМ_ФормыСлужебныйКлиент.Справочник_ДоговорыКонтрагентов_ВидДоговораПриИзменении(ЭтаФорма);
	//-- Бормотов.А.Ю.
КонецПроцедуры

#КонецОбласти
