#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ВКМ_изменено
	ВКМ_ФормыСлужебный.Справочник_ДоговорыКонтрагентов_ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	//ВКМ_изменено 
	ВКМ_ФормыСлужебныйКлиент.Справочник_ДоговорыКонтрагентов_ВидДоговораПриИзменении(ЭтаФорма);
КонецПроцедуры

#КонецОбласти
