#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Выплаты.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ВКМ_ПередАвтозаполнениемЗавершение", ЭтотОбъект),
						"Перед заполнением табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ВыполнитьАвтозаполнение();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ПередАвтозаполнениемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Выплаты.Очистить();
		ЗаполнитьНаСервере()
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
