#Область ОбработчикиСобытийФорм

Процедура Справочник_ДоговорыКонтрагентов_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Форма.ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ВКМ_ФормаЭлемента" Тогда
	
		Элементы = Форма.Элементы;
		Объект = Форма.Объект;
		
		НоваяГруппа = Элементы.Добавить("ВКМ_ГруппаДополнительныеРеквизитыАбонентскогоОбслуживания", 
											Тип("ГруппаФормы"));
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.Заголовок = "Информация об абонентском обслуживании";
		НоваяГруппа.ОтображатьЗаголовок = Истина;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
		НоваяГруппа.РастягиватьПоГоризонтали = Ложь;
		НоваяГруппа.РастягиватьПоВертикали = Ложь;
		НоваяГруппа.Видимость = Ложь;
		
		НоваяГруппа = Элементы.Добавить("ВКМ_ГруппаНачалоОкончаниеДействияДоговора", 
											Тип("ГруппаФормы"), 
											Элементы.ВКМ_ГруппаДополнительныеРеквизитыАбонентскогоОбслуживания);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.Заголовок = "";
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
		НоваяГруппа.РастягиватьПоГоризонтали = Ложь;
		НоваяГруппа.РастягиватьПоВертикали = Ложь;
		
		НовыйЭлемент = Форма.Элементы.Добавить("ВКМ_НачалоДействияДоговора", 
											Тип("ПолеФормы"), 
											Элементы.ВКМ_ГруппаНачалоОкончаниеДействияДоговора);																		
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора";
		НовыйЭлемент.Заголовок = "Срок действия договора с";
		НовыйЭлемент.Ширина = 10;
		НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		НовыйЭлемент.РастягиватьПоВертикали = Ложь;
		
		НовыйЭлемент = Форма.Элементы.Добавить("ВКМ_ОкончаниеДействияДоговора", 
											Тип("ПолеФормы"), 
											Элементы.ВКМ_ГруппаНачалоОкончаниеДействияДоговора);																		
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ОкончаниеДействияДоговора";
		НовыйЭлемент.Заголовок = "по";
		НовыйЭлемент.Ширина = 10;
		НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		НовыйЭлемент.РастягиватьПоВертикали = Ложь;
	
		НовыйЭлемент = Форма.Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", 
											Тип("ПолеФормы"), 
											Элементы.ВКМ_ГруппаДополнительныеРеквизитыАбонентскогоОбслуживания);																		
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
		НовыйЭлемент.Заголовок = "Сумма абонентской платы";
		НовыйЭлемент.Ширина = 10;
		НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		НовыйЭлемент.РастягиватьПоВертикали = Ложь;
	
		НовыйЭлемент = Форма.Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", 
											Тип("ПолеФормы"), 
											Элементы.ВКМ_ГруппаДополнительныеРеквизитыАбонентскогоОбслуживания);																		
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		НовыйЭлемент.Заголовок = "Стоимость часа работы";
		НовыйЭлемент.Ширина = 10;
		НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		НовыйЭлемент.РастягиватьПоВертикали = Ложь;
		
		Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
			Элементы.ВКМ_ГруппаДополнительныеРеквизитыАбонентскогоОбслуживания.Видимость = Истина;
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура Документ_РеализацияТоваровУслуг_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Форма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		
		НоваяКоманда = Форма.Команды.Добавить("ВКМ_Заполнить");
		НоваяКоманда.Действие = "ВКМ_КомандаЗаполнить";
		НоваяКоманда.Заголовок = "Заполнить";
		НоваяКоманда.ИзменяетСохраняемыеДанные = Истина;
		
		НовыйЭлемент = Форма.Элементы.Добавить("ВКМ_Заполнить", Тип("КнопкаФормы"), Форма.Элементы.УслугиКоманднаяПанель);
		НовыйЭлемент.ИмяКоманды = "ВКМ_Заполнить";
		НовыйЭлемент.Заголовок = "Заполнить";
		НовыйЭлемент.КнопкаПоУмолчанию = Ложь;
		НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		НовыйЭлемент.РастягиватьПоВертикали = Ложь;
		НовыйЭлемент.Ширина = 10;
		НовыйЭлемент.Высота = 1;
		НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		НовыйЭлемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
		НовыйЭлемент.Картинка = БиблиотекаКартинок.ЗаполнитьФорму;
		НовыйЭлемент.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанели;
		НовыйЭлемент.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти