#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ОбновитьТаблицуДоговоров();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	Если СписокДоговоров.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
    ОперацияСозданияДокументов = ЗапуститьДлительнуюОперацию();

    ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект); 
    ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
    ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗавершенииДлительнойОперации", ЭтотОбъект);
    ДлительныеОперацииКлиент.ОжидатьЗавершение(ОперацияСозданияДокументов, ОписаниеОповещения, ПараметрыОжидания); 

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьТаблицуДоговоров();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьТаблицуДоговоров()
	
	СписокДоговоров.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.Ссылка КАК Договор
	|ПОМЕСТИТЬ ВТ_Договоры
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|	И ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора < &КонецПериода
	|	И (ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора >= &НачалоПериода
	|	ИЛИ ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора = ДАТАВРЕМЯ(1, 1, 1))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Договор КАК Договор,
	|	РеализацияТоваровУслуг.Договор.ВидДоговора КАК ДоговорВидДоговора
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РеализацияТоваровУслуг.Проведен
	|	И
	|		РеализацияТоваровУслуг.Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Договоры.Контрагент КАК Контрагент,
	|	ВТ_Договоры.Договор КАК Договор,
	|	ВТ_Реализации.Ссылка КАК ДокументРеализацииУслуг
	|ИЗ
	|	ВТ_Договоры КАК ВТ_Договоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
	|		ПО ВТ_Договоры.Договор = ВТ_Реализации.Договор";

	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СписокДоговоров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьДлительнуюОперацию()       
    
    СписокДоговоровМассив = ОбщегоНазначения.ТаблицаЗначенийВМассив(СписокДоговоров.Выгрузить());
    
    ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);              
    Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
    												"ВКМ_Служебный.МассовоеСозданиеАктов_СоздатьДокументыРеализации",  
													СписокДоговоров.Выгрузить(),
													Период);
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииДлительнойОперации(РезультатВоВременномХранилище, ДополнительныеПараметры) Экспорт
    
    Если РезультатВоВременномХранилище = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Если РезультатВоВременномХранилище.Статус = "Ошибка" Тогда
        ВызватьИсключение РезультатВоВременномХранилище.ПодробноеПредставлениеОшибки;
    КонецЕсли;
    
    Если РезультатВоВременномХранилище.Статус = "Выполнено" Тогда
        ПоказатьПредупреждение( , "Документы созданы!");
        ОбновитьТаблицуДоговоров();
    КонецЕсли;

КонецПроцедуры

#КонецОбласти