#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ВКМ_УсловияОплатыСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сотрудник.Установить(Ссылка);
	НаборЗаписей.Отбор.Период.Установить(НачалоМесяца(ТекущаяДатаСеанса()));
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	ЗаписьРегистра = НаборЗаписей.Добавить();
	ЗаписьРегистра.Период = ТекущаяДатаСеанса();
	ЗаписьРегистра.Сотрудник = Ссылка;
	ЗаписьРегистра.КатегорияСотрудника = Категория;
	ЗаписьРегистра.Оклад = Оклад;
	ЗаписьРегистра.ПроцентОтРабот = ПроцентОтРабот;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти