Процедура ОтправитьСообщенияВЧат(ТекстСообщения, Токен = Неопределено, ИДГруппы = Неопределено) Экспорт
	
	//Токен = ВКМ_ТокенУправленияТелеграмБотом.Получить();
	//ИДГруппы = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	
	Соединение = Новый HTTPСоединение("api.telegram.org", 443,,,,Истина);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");

	Запрос = Новый HTTPЗапрос("/bot" + Токен + "/sendMessage", Заголовки);
	
	Сообщение = Новый Структура;
	Сообщение.Вставить("chat_id", ИДГруппы);
	Сообщение.Вставить("text", ТекстСообщения);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Сообщение);
	СообщениеJSON = ЗаписьJSON.Закрыть();
	
	Запрос.УстановитьТелоИзСтроки(СообщениеJSON);
	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		Сообщить("Хьюстон у нас проблемы");
	КонецЕсли;
	
КонецПроцедуры